Revit 2024 API
LinkVisibility Enumeration
 Link visibility types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public enum LinkVisibility
Visual Basic
Public Enumeration LinkVisibility
Visual C++
public enum class LinkVisibility
Members
Member name | Description
ByHostView
ByLinkView
Custom
See Also
Autodesk.Revit.DB Namespace